cases/chpt4-paraboloid-fast/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          2160;
        startFace       314940;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6000;
        startFace       317100;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6000;
        startFace       323100;
    }
    side1Andside2Andside3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3960;
        startFace       329100;
    }
)

// ************************************************************************* //
