cases/chpt4-paraboloid-fast/0/ElPot
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      ElPot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;  

boundaryField
{
    sym
    {
        type            symmetry;
    }
    top
    {
        type            zeroGradient;
    }
    btm
    {
        type            zeroGradient;
    }
    side1Andside2Andside3
    {
        type            zeroGradient;
    }
}    

// ************************************************************************* //
